# Управляющие конструкции в C#

Этот модуль подробно раскрывает механизмы управления логикой и потоком программы на языке C#. Рассматриваются условные операторы, циклы и ключевые переходы, необходимые для построения гибких алгоритмов.

## Теоретический материал

### Условные операторы

C# предоставляет несколько механизмов для выбора направления работы программы в зависимости от выполняемых условий:

- `if` — ключевое слово для однозначного ветвления.
- `else` — альтернативная ветвь, срабатывающая при невыполнении условия.
- `else if` — расширяет базовый вариант, позволяя проверить несколько условий подряд.
- `switch` — упрощает выбор действий при большом количестве альтернатив, поддерживает выражения (`case`, `default`).

**Примеры:**
```csharp
int n = 10;
if (n > 5)
{
    Console.WriteLine("n больше 5");
}
else
{
    Console.WriteLine("n не больше 5");
}

switch (n)
{
    case 5:
        Console.WriteLine("n = 5");
        break;
    case 10:
        Console.WriteLine("n = 10");
        break;
    default:
        Console.WriteLine("n имеет другое значение");
        break;
}
```

### Операторы циклов

Для организации повторяемого действия (итераций) предусмотрено несколько конструкций:
- `for` — цикл с параметрами: счётчиком, условием, шагом увеличения/уменьшения.
- `while` — выполняет тело цикла, пока условие истинно.
- `do while` — гарантирует хотя бы одну итерацию, условие проверяется после тела.
- `foreach` — удобен для перебора элементов коллекций и массивов.

**Примеры:**
```csharp
for (int i = 0; i < 5; i++)
{
    Console.WriteLine(i);
}

int j = 0;
while (j < 5)
{
    Console.WriteLine(j);
    j++;
}

do
{
    Console.WriteLine(j);
    j--;
} while (j > 0);

int[] arr = {1,2,3};
foreach (int item in arr)
{
    Console.WriteLine(item);
}
```

### Операторы перехода

Используются для явного управления потоком выполнения:
- `break` — завершает цикл или конструкцию switch.
- `continue` — мгновенно переходит к следующей итерации цикла.
- `return` — завершает работу метода, возвращая значение.
- `goto` — позволяет выполнять переход к определённой метке внутри метода (используется редко, потенциально уменьшает читаемость).

## Практические рекомендации
- Всегда проверяйте условия, чтобы избежать бесконечных циклов и ошибок ветвления.
- Избегайте использования `goto`, если задачи можно решить структурированным кодом с помощью других операторов.
- Комментируйте логические ветки и условия для облегчения сопровождения.

## Практическое задание

1. Напишите программу, которая:
    - Запрашивает у пользователя целое число.
    - Использует оператор if для утверждения, больше ли оно 10.
    - Использует switch для вывода разных сообщений в зависимости от диапазона числа (например, <0, 0, 1-10, >10).
2. Выведите с помощью цикла for числа от 1 до 20, пропуская все кратные 3. Используйте оператор continue.
3. С помощью while сложите числа от 1 до 10 и выведите итоговую сумму.
4. Используйте foreach для вывода элементов заранее объявленного массива строк.

## Для самостоятельного изучения
- Официальная документация Microsoft по операторам управления: https://docs.microsoft.com/ru-ru/dotnet/csharp/language-reference/statements/selection-statements
- Видеоуроки: https://metanit.com/sharp/tutorial/2.5.php

Все задания сопровождайте комментариями, чтобы показать логику работы алгоритма.